Revit 2024 API
ComponentRepeaterIterator Members
The ComponentRepeaterIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ComponentRepeaterIterator
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCurrent
 Returns the current repeater slot.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next item.
Reset
 Resets the iterator to the initial state.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace